rikkapro0128/system_node_esp32_iot/src/main.cpp
void controllDevice(uint8_t numDevice, bool state, bool syncFirebase, bool ignore)
{
#ifdef _RELEASE_
  blockControl = true;
  if (!ignore)
  {
    Serial.printf("188%c%d\n", state ? 'n' : 'f', numDevice);
  }
  if (syncFirebase)
  {
    String pathControll = eeprom.DATABASE_NODE + "/devices/" + ID_DEVICE + "-" + String(numDevice) + "/state";
    while (!Firebase.RTDB.setBool(&fbdoControl, pathControll, state))
    {
      if (WiFi.status() != WL_CONNECTED)
      {
        break;
      }
    };
  }
  stateDevice[numDevice - 1] = state;
  blockControl = false;
#endif
}

void parserTimerJson(FirebaseStream &data, uint8_t numberDevice, bool isInit)
{
  String deviceField = "device-" + GEN_ID_BY_MAC + "-" + numberDevice;
  if (isInit)
  {
    if (data.jsonObject().get(timerJson, deviceField + "/timer"))
    {
      timerJson.get<FirebaseJson>(timerParseArray);
      readTimer(timerParseArray, numberDevice);
      timerJson.clear();
    }
  }
  else
  {
    readTimer(data.jsonObject(), numberDevice, data.dataPath().substring(29, 49));
  }
}

void readTimer(FirebaseJson &fbJson, uint8_t numberDevice, String keyAdd)
{
  size_t numTimerPayload = fbJson.iteratorBegin();
  FirebaseJson::IteratorValue timerItem;
  size_t indexStart;
  for (size_t i = 0; i < NUMS_TIMER; i++)
  {
    if (timerStack[i][0] == NULL && timerStack[i][1] == NULL && timerStack[i][2] == NULL)
    {
      indexStart = i;
      break;
    }
  }
  for (size_t i = 0; i < numTimerPayload; i++)
  {
    if (indexStart < 30)
    {
      timerItem = fbJson.valueAt(i);
      if (timerItem.key.equals("unix"))
      {
        timerStack[indexStart][0] = numberDevice;
        timerStack[indexStart][1] = timerItem.value.toInt();
      }
      else if (timerItem.key.equals("value"))
      {
        timerStack[indexStart][2] = timerItem.value.toInt();
        if (keyAdd.length() > 0)
        {
          strcpy(indexTimerStack[indexStart], keyAdd.c_str());
        }
        indexStart++;
      }
      else
      {
        strcpy(indexTimerStack[indexStart], timerItem.key.c_str());
      }
    }
    else
    {
      break;
    }
  }
  fbJson.iteratorEnd();
}

#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 *   [********* {START} DEFINE FUNCTION NODE -> TYPE "COLOR" *********]
 *
 */

// ..... define here ...

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 *   [********* {START} DEFINE FUNCTION GENERAL *********]
 *
 */

float_t ramHeapSize()
{
  uint32_t ramSize = ESP.getFreeHeap();
  return (float_t)(ramSize / ESP.getFlashChipSize() * 100);
}

void clearBufferFirebaseDataAll()
{
  fbdoStream.clear();
  fbdoControl.clear();
  createNode.clear();
}

void setupStreamFirebase()
{
  Firebase.RTDB.setStreamCallback(&fbdoStream, streamCallback, streamTimeoutCallback);
  String pathStream;
  #ifdef LOGIC
    pathStream = eeprom.DATABASE_NODE + "/devices";
  #endif
  #ifdef COLOR
    pathStream = eeprom.DATABASE_NODE + "/value";
  #endif
  if (pathStream.length() > 0)
  {
    if (!Firebase.RTDB.beginStream(&fbdoStream, pathStream))
    {
#ifdef _DEBUG_
      Serial_Printf("stream begin error, %s\n\n", fbdoStream.errorReason().c_str());
#endif
    }
    else
    {
#ifdef _DEBUG_
      Serial.println(String("Stream OK!"));
#endif
    }
  }
}

void streamCallback(FirebaseStream data)
{
#ifdef _DEBUG_
  Serial.println(ESP.getFreeHeap());
  Serial_Printf("sream path, %s\nevent path, %s\ndata type, %s\nevent type, %s\n\n",
                data.streamPath().c_str(),
                data.dataPath().c_str(),
                data.dataType().c_str(),
                data.eventType().c_str());
  Serial.println();
  Serial_Printf("Received stream payload size: %d (Max. %d)\n\n", data.payloadLength(), data.maxPayloadLength());
#endif
#ifdef LOGIC
  String dataPath = data.dataPath();
  uint8_t dataType = data.dataTypeEnum();
  uint8_t numDevice = (uint8_t)(dataPath.substring(21, 22).toInt());
  if (dataType == d_boolean)
  {
    if (dataPath.indexOf("state") > 0 || numDevice) // execute controll turn on device by [INDEX]
    {
      if (data.dataTypeEnum() == fb_esp_rtdb_data_type_boolean)
      {
        bool state = data.to<boolean>();
        if (!blockControl)
        {
          controllDevice(numDevice, state);
        }
      }
    }
  }
  else if (dataType == d_json)
  {
    if (dataPath.equals("/") && isFirst)
    { // execute init state all device
#ifdef _DEBUG_
      Serial.println("Init Status");
#endif
      parserTimerJson(data, 1);
      parserTimerJson(data, 2);
      parserTimerJson(data, 3);

      sortTimer(timerStack, indexTimerStack);

      parserDeviceStatus(data, 1);
      parserDeviceStatus(data, 2);
      parserDeviceStatus(data, 3);
      timeControll = true;
      isFirst = false;
    }
    else if (dataPath.indexOf("timer") > 0 && numDevice)
    {
      parserTimerJson(data, numDevice, false); // add timer to list timer
      sortTimer(timerStack, indexTimerStack);
      timeControll = true;
    }
#ifdef _DEBUG_
    PrintListTimer();
#endif
  }
  else if (dataType == d_null)
  {
    removeTimer(timerStack, indexTimerStack, dataPath.substring(29, 49), true);
#ifdef _DEBUG_
    PrintListTimer();
#endif
  }
#endif
}

void streamTimeoutCallback(bool timeout)
{
#ifdef _DEBUG_
  if (timeout)
  {
    Serial.println("Stream timed out, resuming...\n");
  }
  if (!fbdoStream.httpConnected())
  {
    Serial_Printf("error code: %d, reason: %s\n\n", fbdoStream.httpCode(), fbdoStream.errorReason().c_str());
  }
#endif
}

void checkFirebaseInit()
{
  // [Check] - NodeID is exist

  if (eeprom.canAccess)
  {
    String pathDevice = String(eeprom.DATABASE_NODE + "/devices");
    bool statePath = Firebase.RTDB.pathExisted(&fbdoStream, pathDevice);
#ifdef _DEBUG_
    Serial.println(String("PATH Device = " + String(pathDevice)));
    Serial.println(String("State Path = " + String(statePath)));
#endif
    if (!statePath)
    {
      jsonNewDevice.clear();
#ifdef LOGIC
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-1/state", false);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-1/type", TYPE_DEVICE);

      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-2/state", false);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-2/type", TYPE_DEVICE);

      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-3/state", false);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "-3/type", TYPE_DEVICE);
#endif

#ifdef COLOR
      // ... init device COLOR
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "/value/r", 0);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "/value/g", 0);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "/value/b", 0);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "/value/contrast", 0);
      jsonNewDevice.set("device-" + GEN_ID_BY_MAC + "/type", TYPE_DEVICE);
#endif

      if (Firebase.RTDB.setJSON(&createNode, pathDevice, &jsonNewDevice))
      {
        createNode.clear();
      }

#ifdef _DEBUG_
      Serial.println("[CREATED] - NEW LIST DEVICE");
#endif
    }
    if (fbdoStream.isStream())
    {
      Firebase.RTDB.endStream(&fbdoStream);
    }
    setupStreamFirebase();
  }
}

void setupWifiModeStation()
{
  // ACTIVE MODE AP
  String ssid = eeprom.readSSID();
  String password = eeprom.readPassword();
#ifdef _DEBUG_
  Serial.println("<--- STATION WIFI --->");
  Serial.println("[SSID] = " + String(ssid));
  Serial.println("[PASSWORD] = " + String(password));
#endif
  if (ssid.length() > 0 && password.length() > 0)
  {
    if (WiFi.isConnected())
    {
      WiFi.disconnect(true);
    }
    WiFi.setAutoConnect(true);
    WiFi.setAutoReconnect(true);
    WiFi.begin(ssid.c_str(), password.c_str());
  }
}

unsigned int strLength(const char *str)
{
  return sizeof(str) / sizeof(char);
}

void setupWebserverModeAP()
{
  // [GET] - ROUTE: '/' => Render UI interface
  // server.serveStatic("/", LittleFS, "/index.minify.html");
  // [GET] - ROUTE: '/reset-config' => Reset config WIFI
  // server.on("/scan-network", HTTP_GET, scanListNetwork);
  // [GET] - ROUTE: '/is-config' => Check WIFI is configuration
  server.on("/is-config", HTTP_GET, checkConfiguration);
  // [GET] - ROUTE: '/restart' => restart ESP
  server.on("/restart", HTTP_GET, restartEsp);
  // [POST] - ROUTE: '/reset-config-wifi' => Reset config WIFI
  server.on("/reset-config-wifi", HTTP_POST, resetConfigurationWifi);
  // [POST] - ROUTE: '/reset-config-firebase' => Reset config firebase
  server.on("/reset-config-firebase", HTTP_POST, resetConfigurationFirebase);
  // [POST] - ROUTE: '/config-wifi' => Goto config WIFI save below EEPROM
  AsyncCallbackJsonWebHandler *handlerAddConfig = new AsyncCallbackJsonWebHandler("/config-wifi", addConfiguration);
  // [POST] - ROUTE: '/link-app' => Goto config firebase save below EEPROM
  AsyncCallbackJsonWebHandler *handlerLinkApp = new AsyncCallbackJsonWebHandler("/link-app", linkAppication);
  // [GET] - ROUTE: '/is-link-app' => Check configuration link-app
  server.on("/is-link-app", HTTP_GET, checkLinkAppication);
  // [GET] - ROUTE: '/*any' => Check configuration link-app
  server.onNotFound(notFound);

  // START WEBSERVER
  server.addHandler(handlerAddConfig);
  server.addHandler(handlerLinkApp);
  server.begin();
}

unsigned long Get_Epoch_Time()
{
  time_t now;
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo))
  {
    // Serial.println("Failed to obtain time");
    return (0);
  }
  time(&now);
  return now;
}

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */
